## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_resource_group.rg-aks will be destroyed
  # (because azurerm_resource_group.rg-aks is not in configuration)
  - resource "azurerm_resource_group" "rg-aks" {
      - id       = "/subscriptions/0bcdd247-28cc-4143-9247-6149a34d75ea/resourceGroups/rg-terraform-github-actions" -> null
      - location = "eastus" -> null
      - name     = "rg-terraform-github-actions" -> null
      - tags     = {} -> null
    }

  # azurerm_resource_group.rg-terraform will be created
  + resource "azurerm_resource_group" "rg-terraform" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-terraform-github-actions"
    }

  # azurerm_virtual_network.name will be created
  + resource "azurerm_virtual_network" "name" {
      + address_space       = [
          + "10.0.0.0./16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "vnet-terraform-github-actions"
      + resource_group_name = "rg-terraform-github-actions"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>